package examples.by.yurachel.blinov.patterns.behavioral_patterns.observer.basic;

/*В системах данные бывают отделены от их представлений. Для сохранения со-
гласованности информации необходим механизм немедленного уведомления всех
заинтересованных объектов об изменениях состояния связанного с ними объекта.
То есть требуется определить связь «один ко многим» между объектами таким
образом, чтобы при изменении состояния одного объекта все связанные с ним объ-
екты должны автоматически изменить свое представление. Объект, изменяющий
состояние, ничего не знает о том, что будет делать Observer с переденной ему
информацией. Позволяет наблюдать за несколькими объектами одному экзем-
пляру Observer. В языке Java этот шаблон известен под именем Listener.
* */
public interface Observer {
     void update();
}
