package examples.by.yurachel.blinov.patterns.behavioral_patterns.strategy.basic;

/*
* Необходимо определить семейство родственных алгоритмов, инкапсулиро-
вать каждый из них и сделать их взаимозаменяемыми. Стратегия позволяет
изменять алгоритмы независимо от клиентов, которые ими пользуются.
Алгоритмы решают близкие задачи и обладают идентичным интерфейсом.
Отличия начинаются только в реализации. К примерам таких задач относятся
алгоритмы сортировки, поиска, архивирования, кодирования, генерации слу-
чайных чисел и прочих. Известен также под названием Policy.*/
public interface Strategy {
     void algorithm();
}
